bivex/ArchC/tests/esp32c3/esp32c3_isa_init.cpp
/******************************************************
 * AC_ISA Initialization File                         *
 * This file is automatically generated by ArchC      *
 * WITHOUT WARRANTY OF ANY KIND, either express       *
 * or implied.                                        *
 * For more information on ArchC, please visit:       *
 * http://www.archc.org                               *
 *                                                    *
 * The ArchC Team                                     *
 * Computer Systems Laboratory (LSC)                  *
 * IC-UNICAMP                                         *
 * http://www.lsc.ic.unicamp.br                       *
 ******************************************************/
 

#include "esp32c3_isa.H"

//!Fields table declaration.
ac_dec_field esp32c3_parms::esp32c3_isa::fields[esp32c3_parms::AC_DEC_FIELD_NUMBER] = {
  {"funct7", 7, 31, 1, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[1])},
  {"rs2", 5, 24, 2, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[2])},
  {"rs1", 5, 19, 3, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[3])},
  {"funct3", 3, 14, 4, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[4])},
  {"rd", 5, 11, 5, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[5])},
  {"op", 7, 6, 6, 0, 0, NULL},
  {"imm12", 12, 31, 7, 0, 1, &(esp32c3_parms::esp32c3_isa::fields[7])},
  {"rs1", 5, 19, 3, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[8])},
  {"funct3", 3, 14, 4, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[9])},
  {"rd", 5, 11, 5, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[10])},
  {"op", 7, 6, 6, 0, 0, NULL},
  {"imm7", 7, 31, 8, 0, 1, &(esp32c3_parms::esp32c3_isa::fields[12])},
  {"rs2", 5, 24, 2, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[13])},
  {"rs1", 5, 19, 3, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[14])},
  {"funct3", 3, 14, 4, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[15])},
  {"imm5", 5, 11, 5, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[16])},
  {"op", 7, 6, 6, 0, 0, NULL},
  {"imm12", 1, 31, 9, 0, 1, &(esp32c3_parms::esp32c3_isa::fields[18])},
  {"imm10", 6, 30, 10, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[19])},
  {"rs2", 5, 24, 2, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[20])},
  {"rs1", 5, 19, 3, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[21])},
  {"funct3", 3, 14, 4, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[22])},
  {"imm4", 4, 11, 11, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[23])},
  {"imm11", 1, 7, 12, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[24])},
  {"op", 7, 6, 6, 0, 0, NULL},
  {"imm20", 20, 31, 13, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[26])},
  {"rd", 5, 11, 5, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[27])},
  {"op", 7, 6, 6, 0, 0, NULL},
  {"imm20", 1, 31, 9, 0, 1, &(esp32c3_parms::esp32c3_isa::fields[29])},
  {"imm10", 10, 30, 14, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[30])},
  {"imm11", 1, 20, 15, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[31])},
  {"imm8", 8, 19, 16, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[32])},
  {"rd", 5, 11, 5, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[33])},
  {"op", 7, 6, 6, 0, 0, NULL},
  {"op", 7, 31, 1, 0, 0, &(esp32c3_parms::esp32c3_isa::fields[35])},
  {"pad", 25, 24, 17, 0, 0, NULL}
};

ac_dec_format esp32c3_parms::esp32c3_isa::formats[esp32c3_parms::AC_DEC_FORMAT_NUMBER] = {
  {1, "Type_R", 32, &(esp32c3_parms::esp32c3_isa::fields[0]), &(esp32c3_parms::esp32c3_isa::formats[1])},
  {2, "Type_I", 32, &(esp32c3_parms::esp32c3_isa::fields[6]), &(esp32c3_parms::esp32c3_isa::formats[2])},
  {3, "Type_S", 32, &(esp32c3_parms::esp32c3_isa::fields[11]), &(esp32c3_parms::esp32c3_isa::formats[3])},
  {4, "Type_B", 32, &(esp32c3_parms::esp32c3_isa::fields[17]), &(esp32c3_parms::esp32c3_isa::formats[4])},
  {5, "Type_U", 32, &(esp32c3_parms::esp32c3_isa::fields[25]), &(esp32c3_parms::esp32c3_isa::formats[5])},
  {6, "Type_J", 32, &(esp32c3_parms::esp32c3_isa::fields[28]), &(esp32c3_parms::esp32c3_isa::formats[6])},
  {7, "Type_H", 32, &(esp32c3_parms::esp32c3_isa::fields[34]), NULL}
};

ac_dec_list esp32c3_parms::esp32c3_isa::dec_list[esp32c3_parms::AC_DEC_LIST_NUMBER] = {
  {"op", 6, 51, &(esp32c3_parms::esp32c3_isa::dec_list[1])},
  {"funct3", 4, 0, &(esp32c3_parms::esp32c3_isa::dec_list[2])},
  {"funct7", 1, 0, NULL},
  {"op", 6, 51, &(esp32c3_parms::esp32c3_isa::dec_list[4])},
  {"funct3", 4, 0, &(esp32c3_parms::esp32c3_isa::dec_list[5])},
  {"funct7", 1, 32, NULL},
  {"op", 6, 51, &(esp32c3_parms::esp32c3_isa::dec_list[7])},
  {"funct3", 4, 7, &(esp32c3_parms::esp32c3_isa::dec_list[8])},
  {"funct7", 1, 0, NULL},
  {"op", 6, 51, &(esp32c3_parms::esp32c3_isa::dec_list[10])},
  {"funct3", 4, 6, &(esp32c3_parms::esp32c3_isa::dec_list[11])},
  {"funct7", 1, 0, NULL},
  {"op", 6, 51, &(esp32c3_parms::esp32c3_isa::dec_list[13])},
  {"funct3", 4, 4, &(esp32c3_parms::esp32c3_isa::dec_list[14])},
  {"funct7", 1, 0, NULL},
  {"op", 6, 51, &(esp32c3_parms::esp32c3_isa::dec_list[16])},
  {"funct3", 4, 1, &(esp32c3_parms::esp32c3_isa::dec_list[17])},
  {"funct7", 1, 0, NULL},
  {"op", 6, 51, &(esp32c3_parms::esp32c3_isa::dec_list[19])},
  {"funct3", 4, 5, &(esp32c3_parms::esp32c3_isa::dec_list[20])},
  {"funct7", 1, 0, NULL},
  {"op", 6, 51, &(esp32c3_parms::esp32c3_isa::dec_list[22])},
  {"funct3", 4, 5, &(esp32c3_parms::esp32c3_isa::dec_list[23])},
  {"funct7", 1, 32, NULL},
  {"op", 6, 51, &(esp32c3_parms::esp32c3_isa::dec_list[25])},
  {"funct3", 4, 2, &(esp32c3_parms::esp32c3_isa::dec_list[26])},
  {"funct7", 1, 0, NULL},
  {"op", 6, 51, &(esp32c3_parms::esp32c3_isa::dec_list[28])},
  {"funct3", 4, 3, &(esp32c3_parms::esp32c3_isa::dec_list[29])},
  {"funct7", 1, 0, NULL},
  {"op", 6, 51, &(esp32c3_parms::esp32c3_isa::dec_list[31])},
  {"funct3", 4, 0, &(esp32c3_parms::esp32c3_isa::dec_list[32])},
  {"funct7", 1, 1, NULL},
  {"op", 6, 51, &(esp32c3_parms::esp32c3_isa::dec_list[34])},
  {"funct3", 4, 1, &(esp32c3_parms::esp32c3_isa::dec_list[35])},
  {"funct7", 1, 1, NULL},
  {"op", 6, 51, &(esp32c3_parms::esp32c3_isa::dec_list[37])},
  {"funct3", 4, 3, &(esp32c3_parms::esp32c3_isa::dec_list[38])},
  {"funct7", 1, 1, NULL},
  {"op", 6, 51, &(esp32c3_parms::esp32c3_isa::dec_list[40])},
  {"funct3", 4, 4, &(esp32c3_parms::esp32c3_isa::dec_list[41])},
  {"funct7", 1, 1, NULL},
  {"op", 6, 51, &(esp32c3_parms::esp32c3_isa::dec_list[43])},
  {"funct3", 4, 5, &(esp32c3_parms::esp32c3_isa::dec_list[44])},
  {"funct7", 1, 1, NULL},
  {"op", 6, 51, &(esp32c3_parms::esp32c3_isa::dec_list[46])},
  {"funct3", 4, 6, &(esp32c3_parms::esp32c3_isa::dec_list[47])},
  {"funct7", 1, 1, NULL},
  {"op", 6, 51, &(esp32c3_parms::esp32c3_isa::dec_list[49])},
  {"funct3", 4, 7, &(esp32c3_parms::esp32c3_isa::dec_list[50])},
  {"funct7", 1, 1, NULL},
  {"op", 6, 19, &(esp32c3_parms::esp32c3_isa::dec_list[52])},
  {"funct3", 4, 0, NULL},
  {"op", 6, 19, &(esp32c3_parms::esp32c3_isa::dec_list[54])},
  {"funct3", 4, 7, NULL},
  {"op", 6, 19, &(esp32c3_parms::esp32c3_isa::dec_list[56])},
  {"funct3", 4, 6, NULL},
  {"op", 6, 19, &(esp32c3_parms::esp32c3_isa::dec_list[58])},
  {"funct3", 4, 4, NULL},
  {"op", 6, 19, &(esp32c3_parms::esp32c3_isa::dec_list[60])},
  {"funct3", 4, 1, NULL},
  {"op", 6, 19, &(esp32c3_parms::esp32c3_isa::dec_list[62])},
  {"funct3", 4, 5, NULL},
  {"op", 6, 19, &(esp32c3_parms::esp32c3_isa::dec_list[64])},
  {"funct3", 4, 2, NULL},
  {"op", 6, 19, &(esp32c3_parms::esp32c3_isa::dec_list[66])},
  {"funct3", 4, 3, NULL},
  {"op", 6, 103, &(esp32c3_parms::esp32c3_isa::dec_list[68])},
  {"funct3", 4, 0, NULL},
  {"op", 6, 3, &(esp32c3_parms::esp32c3_isa::dec_list[70])},
  {"funct3", 4, 2, NULL},
  {"op", 6, 3, &(esp32c3_parms::esp32c3_isa::dec_list[72])},
  {"funct3", 4, 1, NULL},
  {"op", 6, 3, &(esp32c3_parms::esp32c3_isa::dec_list[74])},
  {"funct3", 4, 0, NULL},
  {"op", 6, 35, &(esp32c3_parms::esp32c3_isa::dec_list[76])},
  {"funct3", 4, 2, NULL},
  {"op", 6, 35, &(esp32c3_parms::esp32c3_isa::dec_list[78])},
  {"funct3", 4, 1, NULL},
  {"op", 6, 35, &(esp32c3_parms::esp32c3_isa::dec_list[80])},
  {"funct3", 4, 0, NULL},
  {"op", 6, 99, &(esp32c3_parms::esp32c3_isa::dec_list[82])},
  {"funct3", 4, 0, NULL},
  {"op", 6, 99, &(esp32c3_parms::esp32c3_isa::dec_list[84])},
  {"funct3", 4, 1, NULL},
  {"op", 6, 99, &(esp32c3_parms::esp32c3_isa::dec_list[86])},
  {"funct3", 4, 4, NULL},
  {"op", 6, 99, &(esp32c3_parms::esp32c3_isa::dec_list[88])},
  {"funct3", 4, 5, NULL},
  {"op", 6, 99, &(esp32c3_parms::esp32c3_isa::dec_list[90])},
  {"funct3", 4, 6, NULL},
  {"op", 6, 99, &(esp32c3_parms::esp32c3_isa::dec_list[92])},
  {"funct3", 4, 7, NULL},
  {"op", 6, 55, NULL},
  {"op", 6, 23, NULL},
  {"op", 6, 111, NULL},
  {"op", 1, 0, NULL}
};

ac_dec_instr esp32c3_parms::esp32c3_isa::instructions[esp32c3_parms::AC_DEC_INSTR_NUMBER] = {
  {"add", 4, "add", "add %rd, %rs1, %rs2", "Type_R", 1, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[0]), 0, &(esp32c3_parms::esp32c3_isa::instructions[1])},
  {"sub", 4, "sub", "sub %rd, %rs1, %rs2", "Type_R", 2, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[3]), 0, &(esp32c3_parms::esp32c3_isa::instructions[2])},
  {"and_op", 4, "and", "and %rd, %rs1, %rs2", "Type_R", 3, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[6]), 0, &(esp32c3_parms::esp32c3_isa::instructions[3])},
  {"or_op", 4, "or", "or %rd, %rs1, %rs2", "Type_R", 4, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[9]), 0, &(esp32c3_parms::esp32c3_isa::instructions[4])},
  {"xor_op", 4, "xor", "xor %rd, %rs1, %rs2", "Type_R", 5, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[12]), 0, &(esp32c3_parms::esp32c3_isa::instructions[5])},
  {"sll_op", 4, "sll", "sll %rd, %rs1, %rs2", "Type_R", 6, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[15]), 0, &(esp32c3_parms::esp32c3_isa::instructions[6])},
  {"srl_op", 4, "srl", "srl %rd, %rs1, %rs2", "Type_R", 7, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[18]), 0, &(esp32c3_parms::esp32c3_isa::instructions[7])},
  {"sra_op", 4, "sra", "sra %rd, %rs1, %rs2", "Type_R", 8, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[21]), 0, &(esp32c3_parms::esp32c3_isa::instructions[8])},
  {"slt", 4, "slt", "slt %rd, %rs1, %rs2", "Type_R", 9, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[24]), 0, &(esp32c3_parms::esp32c3_isa::instructions[9])},
  {"sltu", 4, "sltu", "sltu %rd, %rs1, %rs2", "Type_R", 10, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[27]), 0, &(esp32c3_parms::esp32c3_isa::instructions[10])},
  {"mul_op", 4, "mul", "mul %rd, %rs1, %rs2", "Type_R", 11, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[30]), 0, &(esp32c3_parms::esp32c3_isa::instructions[11])},
  {"mulh_op", 4, "mulh", "mulh %rd, %rs1, %rs2", "Type_R", 12, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[33]), 0, &(esp32c3_parms::esp32c3_isa::instructions[12])},
  {"mulhu_op", 4, "mulhu", "mulhu %rd, %rs1, %rs2", "Type_R", 13, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[36]), 0, &(esp32c3_parms::esp32c3_isa::instructions[13])},
  {"div_op", 4, "div", "div %rd, %rs1, %rs2", "Type_R", 14, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[39]), 0, &(esp32c3_parms::esp32c3_isa::instructions[14])},
  {"divu_op", 4, "divu", "divu %rd, %rs1, %rs2", "Type_R", 15, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[42]), 0, &(esp32c3_parms::esp32c3_isa::instructions[15])},
  {"rem_op", 4, "rem", "rem %rd, %rs1, %rs2", "Type_R", 16, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[45]), 0, &(esp32c3_parms::esp32c3_isa::instructions[16])},
  {"remu_op", 4, "remu", "remu %rd, %rs1, %rs2", "Type_R", 17, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[48]), 0, &(esp32c3_parms::esp32c3_isa::instructions[17])},
  {"addi", 4, "addi", "addi %rd, %rs1, %imm12", "Type_I", 18, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[51]), 0, &(esp32c3_parms::esp32c3_isa::instructions[18])},
  {"andi", 4, "andi", "andi %rd, %rs1, %imm12", "Type_I", 19, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[53]), 0, &(esp32c3_parms::esp32c3_isa::instructions[19])},
  {"ori", 4, "ori", "ori %rd, %rs1, %imm12", "Type_I", 20, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[55]), 0, &(esp32c3_parms::esp32c3_isa::instructions[20])},
  {"xori", 4, "xori", "xori %rd, %rs1, %imm12", "Type_I", 21, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[57]), 0, &(esp32c3_parms::esp32c3_isa::instructions[21])},
  {"slli", 4, "slli", "slli %rd, %rs1, %imm12", "Type_I", 22, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[59]), 0, &(esp32c3_parms::esp32c3_isa::instructions[22])},
  {"srli", 4, "srli", "srli %rd, %rs1, %imm12", "Type_I", 23, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[61]), 0, &(esp32c3_parms::esp32c3_isa::instructions[23])},
  {"slti", 4, "slti", "slti %rd, %rs1, %imm12", "Type_I", 24, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[63]), 0, &(esp32c3_parms::esp32c3_isa::instructions[24])},
  {"sltiu", 4, "sltiu", "sltiu %rd, %rs1, %imm12", "Type_I", 25, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[65]), 0, &(esp32c3_parms::esp32c3_isa::instructions[25])},
  {"jalr", 4, "jalr", "jalr %rd, %rs1, %imm12", "Type_I", 26, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[67]), 0, &(esp32c3_parms::esp32c3_isa::instructions[26])},
  {"lw", 4, "lw", "lw %rd, %imm12(%rs1)", "Type_I", 27, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[69]), 0, &(esp32c3_parms::esp32c3_isa::instructions[27])},
  {"lh", 4, "lh", "lh %rd, %imm12(%rs1)", "Type_I", 28, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[71]), 0, &(esp32c3_parms::esp32c3_isa::instructions[28])},
  {"lb", 4, "lb", "lb %rd, %imm12(%rs1)", "Type_I", 29, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[73]), 0, &(esp32c3_parms::esp32c3_isa::instructions[29])},
  {"sw", 4, "sw", "sw %rs2, %imm7(%rs1, %imm5)", "Type_S", 30, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[75]), 0, &(esp32c3_parms::esp32c3_isa::instructions[30])},
  {"sh", 4, "sh", "sh %rs2, %imm7(%rs1, %imm5)", "Type_S", 31, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[77]), 0, &(esp32c3_parms::esp32c3_isa::instructions[31])},
  {"sb", 4, "sb", "sb %rs2, %imm7(%rs1, %imm5)", "Type_S", 32, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[79]), 0, &(esp32c3_parms::esp32c3_isa::instructions[32])},
  {"beq", 4, "beq", "beq %rs1, %rs2, %imm12", "Type_B", 33, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[81]), 0, &(esp32c3_parms::esp32c3_isa::instructions[33])},
  {"bne", 4, "bne", "bne %rs1, %rs2, %imm12", "Type_B", 34, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[83]), 0, &(esp32c3_parms::esp32c3_isa::instructions[34])},
  {"blt", 4, "blt", "blt %rs1, %rs2, %imm12", "Type_B", 35, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[85]), 0, &(esp32c3_parms::esp32c3_isa::instructions[35])},
  {"bge", 4, "bge", "bge %rs1, %rs2, %imm12", "Type_B", 36, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[87]), 0, &(esp32c3_parms::esp32c3_isa::instructions[36])},
  {"bltu", 4, "bltu", "bltu %rs1, %rs2, %imm12", "Type_B", 37, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[89]), 0, &(esp32c3_parms::esp32c3_isa::instructions[37])},
  {"bgeu", 4, "bgeu", "bgeu %rs1, %rs2, %imm12", "Type_B", 38, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[91]), 0, &(esp32c3_parms::esp32c3_isa::instructions[38])},
  {"lui", 4, "lui", "lui %rd, %imm20", "Type_U", 39, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[93]), 0, &(esp32c3_parms::esp32c3_isa::instructions[39])},
  {"auipc", 4, "auipc", "auipc %rd, %imm20", "Type_U", 40, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[94]), 0, &(esp32c3_parms::esp32c3_isa::instructions[40])},
  {"jal", 4, "jal", "jal %rd, %imm20", "Type_J", 41, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[95]), 0, &(esp32c3_parms::esp32c3_isa::instructions[41])},
  {"halt", 4, "halt", "halt", "Type_H", 42, 1, 1, 1, &(esp32c3_parms::esp32c3_isa::dec_list[96]), 0, NULL}
};

const ac_instr_info
esp32c3_parms::esp32c3_isa::instr_table[esp32c3_parms::AC_DEC_INSTR_NUMBER + 1] = {
  ac_instr_info(0, "_ac_invalid_", "_ac_invalid_", 4),
  ac_instr_info(1, "add", "add", 4),
  ac_instr_info(2, "sub", "sub", 4),
  ac_instr_info(3, "and_op", "and", 4),
  ac_instr_info(4, "or_op", "or", 4),
  ac_instr_info(5, "xor_op", "xor", 4),
  ac_instr_info(6, "sll_op", "sll", 4),
  ac_instr_info(7, "srl_op", "srl", 4),
  ac_instr_info(8, "sra_op", "sra", 4),
  ac_instr_info(9, "slt", "slt", 4),
  ac_instr_info(10, "sltu", "sltu", 4),
  ac_instr_info(11, "mul_op", "mul", 4),
  ac_instr_info(12, "mulh_op", "mulh", 4),
  ac_instr_info(13, "mulhu_op", "mulhu", 4),
  ac_instr_info(14, "div_op", "div", 4),
  ac_instr_info(15, "divu_op", "divu", 4),
  ac_instr_info(16, "rem_op", "rem", 4),
  ac_instr_info(17, "remu_op", "remu", 4),
  ac_instr_info(18, "addi", "addi", 4),
  ac_instr_info(19, "andi", "andi", 4),
  ac_instr_info(20, "ori", "ori", 4),
  ac_instr_info(21, "xori", "xori", 4),
  ac_instr_info(22, "slli", "slli", 4),
  ac_instr_info(23, "srli", "srli", 4),
  ac_instr_info(24, "slti", "slti", 4),
  ac_instr_info(25, "sltiu", "sltiu", 4),
  ac_instr_info(26, "jalr", "jalr", 4),
  ac_instr_info(27, "lw", "lw", 4),
  ac_instr_info(28, "lh", "lh", 4),
  ac_instr_info(29, "lb", "lb", 4),
  ac_instr_info(30, "sw", "sw", 4),
  ac_instr_info(31, "sh", "sh", 4),
  ac_instr_info(32, "sb", "sb", 4),
  ac_instr_info(33, "beq", "beq", 4),
  ac_instr_info(34, "bne", "bne", 4),
  ac_instr_info(35, "blt", "blt", 4),
  ac_instr_info(36, "bge", "bge", 4),
  ac_instr_info(37, "bltu", "bltu", 4),
  ac_instr_info(38, "bgeu", "bgeu", 4),
  ac_instr_info(39, "lui", "lui", 4),
  ac_instr_info(40, "auipc", "auipc", 4),
  ac_instr_info(41, "jal", "jal", 4),
  ac_instr_info(42, "halt", "halt", 4)
};

const unsigned esp32c3_parms::esp32c3_isa::instr_format_table[esp32c3_parms::AC_DEC_INSTR_NUMBER + 1] = {
  0,
  1,
  1,
  1,
  1,
  1,
  1,
  1,
  1,
  1,
  1,
  1,
  1,
  1,
  1,
  1,
  1,
  1,
  2,
  2,
  2,
  2,
  2,
  2,
  2,
  2,
  2,
  2,
  2,
  2,
  3,
  3,
  3,
  4,
  4,
  4,
  4,
  4,
  4,
  5,
  5,
  6,
  7
};
